[
  {
    "id": "api-1753972351618-0",
    "title": "AEM UI developer- React JS",
    "company": "Capgemini",
    "location": "Washington",
    "type": "Full-time",
    "description": "About the job you’re considering\n\nThe role requires React JS development experience with AEM UI exp.\n\nYour role\n• Develop and maintain responsive, high-performance web applications using ReactJS, adhering to the client React/JSX Style Guide.\n• integrating with AEM Content Fragments via GraphQL and REST APIs.\n• Instrument React applications with the Adobe Universal Editor for headless/headful content editing, ensuring seamless integration with AEM.\n• Build custom applications and extensions using Adobe AEM App Builder to manage content fragments and enhance user experiences.\n• Collaborate with backend teams to integrate with Node.js/Express servers and Apigee APIs\n• Optimize frontend performance and ensure cross-browser compatibility\n• Participate in code reviews, testing, and deployment within an Agile environment, utilizing monitoring tools like Application Insights and Splunk.\n\nYour skills and experience\n• Proficient in JavaScript (ES6+) and ReactJS.\n• Knowledge of Node.js and Express for backend integration.\n• Experience with Next.js (SSR/SSG) is a strong plus.\n• Hands-on experience with AEM Content Fragments, GraphQL, and REST APIs.\n• Proficiency with Adobe Universal Editor for content editing in React apps.\n• Familiarity with Adobe AEM App Builder for custom app development.\n• Experience with Azure cloud services (App Services) and Akamai CDN.\n• Understanding of API consumption (GraphQL, RESTful, OAuth).\n• Strong CSS/HTML skills for responsive and accessible design.\n• Ability to debug, optimize, and test frontend performance.\n• Experience with version control (e.g., Git) and CI/CD pipelines.\n• Preferable skills in server-side rendering (SSR) and static site generation (SSG) using frameworks like Next.js,\n• Excellent problem-solving, communication, and collaboration skills.\n• Ability to work effectively in a team and adapt to new tools.\n\n#LI-MS4 #LI-ONSITE\n\nLife at Capgemini\n\nCapgemini supports all aspects of your well-being throughout the changing stages of your life and career. For eligible employees, we offer:\n• Flexible work\n• Healthcare including dental, vision, mental health, and well-being programs\n• Financial well-being programs such as 401(k) and Employee Share Ownership Plan\n• Paid time off and paid holidays\n• Paid parental leave\n• Family building benefits like adoption assistance, surrogacy, and cryopreservation\n• Social well-being benefits like subsidized back-up child/elder care and tutoring\n• Mentoring, coaching and learning programs\n• Employee Resource Groups\n• Disaster Relief\n\nAbout Capgemini\n\nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to\nengineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion.\n\nGet the future you want | www.capgemini.com\n\nDisclaimer\n\nCapgemini is an Equal Opportunity Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to race, national origin, gender identity/expression, age, religion, disability, sexual orientation, genetics, veteran status, marital status or any other characteristic protected by law.\n\nThis is a general description of the Duties, Responsibilities and Qualifications required for this position. Physical, mental, sensory or environmental demands may be referenced in an attempt to communicate the manner in which this position traditionally is performed. Whenever necessary to provide individuals with disabilities an equal employment opportunity, Capgemini will consider reasonable accommodations that might involve varying job requirements and/or changing the way this job is performed, provided that such accommodations do not pose an undue hardship.\n\nCapgemini is committed to providing reasonable accommodations during our recruitment process. If you need assistance or accommodation, please reach out to your recruiting contact.\n\nPlease be aware that Capgemini may capture your image (video or screenshot) during the interview process and that image may be used for verification, including during the hiring and onboarding process.\n\nClick the following link for more information on your rights as an Applicant http://www.capgemini.com/resources/equal-employment-opportunity-is-the-law\n\nApplicants for employment in the US must have valid work authorization that does not now and/or will not in the future require sponsorship of a visa for employment authorization in the US by Capgemini.\n\nCapgemini discloses salary range information in compliance with state and local pay transparency obligations. The disclosed range represents the lowest to highest salary we, in good faith, believe we would pay for this role at the time of this posting, although we may ultimately pay more or less than the disclosed range, and the range may be modified in the future. The disclosed range takes into account the wide range of factors that are considered in making compensation decisions including, but not limited to, geographic location, relevant education, qualifications, certifications, experience, skills, seniority, performance, sales or revenue-based metrics, and business or organizational needs. At Capgemini, it is not typical for an individual to be hired at or near the top of the range for their role. The base salary range for the tagged location is $76,200 - $178,290. This role may be eligible for other compensation including variable compensation, bonus, or commission. Full time regular employees are eligible for paid time off, medical/dental/vision insurance, 401(k), and any other benefits to eligible employees. Note: No amount of pay is considered to be wages or compensation until such amount is earned, vested, and determinable. The amount and availability of any bonus, commission, or any other form of compensation that are allocable to a particular employee remains in the Company's sole discretion unless and until paid and may be modified at the Company’s sole discretion, consistent with the law.",
    "applyUrl": "https://www.indeed.com/viewjob?jk=5e3751446bd43f43&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "postedDate": "2025-07-10",
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT5sgZoGfYI1XsIKjrk-ZrHWEbst6ThTBSeIZcL&s=0"
  },
  {
    "id": "api-1753972351618-1",
    "title": "Senior Full Stack React Developer (On-Site)",
    "company": "Lion Federal",
    "location": "Falls Church",
    "type": "Full-time",
    "description": "Senior Full Stack React Developer\n\nJob Type: On-site, full-time\n\nCity: Falls Church\n\nState/Province: Virginia\n\nLion Federal is a dynamic and rapidly expanding tech company dedicated to delivering cutting-edge AI-powered solutions tailored for enterprise-level clients, including the U.S. Federal government.\n\nAt Lion Federal, we believe our team is the heartbeat of our success. We’ve built an environment where your growth is nurtured, and your voice truly matters. Here, you’ll enjoy all the benefits of a large company, along with some rare perks that set us apart:\n• Build genuine connections with team members at all levels\n• Get quick, meaningful responses from leadership who genuinely care\n• Feel a true sense of ownership, because your insights and feedback shape the future of our company\n\nWe are seeking a highly motivated and experienced Senior Full Stack React Developer to join our dynamic team in Falls Church, VA.\n\nPosition Summary:\n\nIn this role, you will be responsible for both front-end and back-end development, working on building a scalable and efficient platform for enterprise clients. You will collaborate closely with our API and AI development teams to ensure seamless integration and optimal performance. The ideal candidate should be self-driven and capable of delivering robust, high-quality code in a fast-paced environment.\n\nKey Responsibilities:\n• Lead the design, development, and deployment of full-stack web applications using React (front-end) and Node.js, Python, or other relevant back-end technologies.\n• Build and optimize APIs and services for performance, scalability, and security.\n• Collaborate with back-end and AI/ML teams to integrate APIs, databases, and AI-driven services.\n• Ensure the platform is scalable, secure, and optimized for performance, both on the front end and back end.\n• Write clean, maintainable, and well-documented code.\n• Participate in the full software development lifecycle, including code reviews, testing, and continuous deployment.\n• Take ownership of the product lifecycle, ensuring MVPs are delivered quickly to meet business deadlines.\n• Stay up-to-date with industry trends and emerging technologies to ensure our platform stays at the forefront of innovation.\n\nRequirements\n\nRequirements:\n• 5+ years of professional experience in full-stack development with a strong focus on React for front-end development.\n• Proficiency in front-end technologies like JavaScript/TypeScript, HTML5, CSS3, and state management libraries (Redux, Context API).\n• Expertise in back-end technologies like Node.js, Python, or similar, along with experience in building RESTful APIs.\n• Strong understanding of database systems (SQL, NoSQL) and cloud infrastructure (AWS, Azure, Google Cloud).\n• Familiarity with version control tools like Git and CI/CD pipelines.\n• Experience with containerization tools (Docker) and cloud deployment (Kubernetes) is a plus.\n• Excellent communication and problem-solving skills.\n• Self-starter with a passion for innovation and delivering high-quality products.\n\nNice-to-Haves:\n• Experience with AI/ML technologies, particularly Generative AI or LLMs.\n• Exposure to cloud platforms such as AWS, Azure, or Google Cloud.\n• Knowledge of DevOps practices and cloud infrastructure management.\n\nBenefits\n\nWhy Join Us?\n• Be a key player in building innovative AI-driven solutions for enterprise clients.\n• Collaborate with a team of experienced developers and AI experts.\n• Competitive salary and benefits package.\n• Opportunity to make a significant impact and shape the future of our product.\n\nBenefits:\n• Comprehensive CareFirst BCBS Medical, Dental, and Vision insurance fully covered for you and your family\n• Supportive team environment with outstanding leadership that values employee well-being\n• Generous paid time off, plus 11 paid holidays\n• 401(k) retirement plan with employer match\n• Performance-driven bonus program\n• Budget allocated for professional development and growth",
    "applyUrl": "https://www.indeed.com/viewjob?jk=5f515c2eee9e24eb&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "postedDate": "2025-07-31"
  },
  {
    "id": "api-1753972351618-2",
    "title": "React Developer (Always Recruiting)",
    "company": "Dev Talent Network",
    "location": "Washington",
    "type": "Full-time",
    "description": "Dev's Talent Network is designed to create a network of talented applicants who are interested in working for Dev Technology and are waiting for a job opening that matches their skills and experience. Here you will find positions we are \"always recruiting\" as well as an opportunity to share your resume with Dev, even if the job position you seek is not listed here today.\n\nThe Dev Talent Network is a community of highly qualified technical and management professionals recognized by Dev to demonstrate strong alignment with our company culture. The Dev Talent Network is comprised of candidates, referrals, Dev alumni, and fellow colleagues with whom we have worked in the past.\n\nWe're excited to evolve the Dev Talent Network so our members stay connected with Dev and discover new career opportunities with us.\n\nDev Technology Group is looking for a React Developer. As a React.js Developer, you will be involved from conception to completion with projects that are technologically sound and aesthetically impressive.\n\nWhat You'll Be Doing:\n• Develop the latest user-facing features using React.js\n• Use markup languages like HTML to create user-friendly web pages\n• Design a modern highly responsive web-based user interface\n• Build reusable components and front-end libraries for future use\n• Translate designs and wireframes into high-quality code\n• Optimize components for maximum performance across a vast array of web-capable devices and browsers\n• Coordinate with various teams working on distinct layers\n• Maintain and improve website\n• Optimize applications for maximum speed\n• Collaborate with back-end developers and web designers to improve usability\n• Get feedback from, and build solutions for, users and customers\n• Write functional requirement documents and guides\n• Create quality mockups and prototypes\n• Help back-end developers with coding and troubleshooting\n• Ensure high-quality graphic standards and brand consistency\n• Stay up-to-date on emerging technologies\n\nRequired Skills and Experience:\n• Bachelor's degree in Computer Science or related field\n• 5+ years Java/J2EE development\n• 5+ years experience with React, Node, Angular\n• Strong proficiency in JavaScript\n• Thorough understanding of React.js and its core principles\n• Proven work experience as a developer\n• Hands-on experience with markup languages\n• Experience with RESTful APIs\n• Experience with HTML/CSS\n• Experience with code versioning tools such as Git\n• Experience with modern front-end build pipelines and tools\n• Knowledge of Spring, Spring Boot, JPA, Hibernate frameworks\n• Knowledge of modern authorization mechanisms\n• An ability to perform well in a fast-paced environment\n• Excellent analytical skills\n\nPreferred Skills and Experience:\n• SQL preferred\n• PostgreSQL preferred\n• Angular UI or related UI frameworks preferred\n• Experience with Chef, Maven, Ansible preferred\n• Experience with AWS Lambda, AWS Dynamo DB, Other AWS tools (Elastic Search, Cloud Watch, Kinesis, etc) preferred\n• Typescript preferred\n• **By submitting your information you agree our talent recruitment team may use your contact information to reach out to you regarding new opportunities that may be applicable to your experience.",
    "applyUrl": "https://www.ziprecruiter.com/c/Dev-Talent-Network/Job/React-Developer-(Always-Recruiting)/-in-Washington,DC?jid=8df3738081ef006f&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "postedDate": "2025-07-31"
  },
  {
    "id": "api-1753972351618-3",
    "title": "Software Developer (Full Stack - Python, React)",
    "company": "US News & World Report ,L.P.",
    "location": "Washington",
    "type": "Full-time",
    "description": "U.S. News & World Report is a multifaceted digital media company dedicated to helping citizens, consumers, business leaders and policy officials make important decisions in their lives. We publish independent reporting, rankings, data journalism and advice that has earned the trust of our readers and users for over 90 years. Our platforms on usnews.com include Education, Health, Money, Travel, Cars, News and 360 Reviews.\n\nWe reach millions of people monthly during moments when they are most in need of expert advice and motivated to act on that advice directly on our platforms. Our signature franchises include our “Best” series of consumer guides on colleges, graduate schools, hospitals, diets, cars, financial services and more. These guides provide an easy-to-digest list for consumers to better understand and compare when making their decisions. We continue to publish annual guides of the authoritative Best Colleges and Best Hospitals rankings on our website and in print. And our U.S. News Live flagship conferences highlight important national conversations including Healthcare of Tomorrow and Healthiest Communities.\n\nWe believe in having a broad range of talent and backgrounds at U.S. News. We strive to maintain a welcoming workplace where everyone is given an opportunity to succeed and contribute to their fullest. Learn more about our Diversity, Equity and Inclusion initiative.\n\nYour role in helping us shape the future:\n\nWe are looking for an enthusiastic full stack Software Developer with an interest in building dynamic, data-driven products.\n\nU.S. News empowers everyone to thrive. The developers at U.S. News have a great deal of independence and a minimum of overhead. By leveraging React.js, Python, AWS cloud, Google BigQuery, data science and other latest technologies, you’ll be driving a major transformation within U.S. News.\n\nThe successful candidate will become an influential member of a passionate, friendly, and growing team that creates web applications which reach millions of visitors monthly. Developers typically see applications through from beginning to end, working directly with project owners to create, implement, upgrade, optimize, and test features and projects.\n\nWe offer a casual, flexible, hybrid-remote work environment. Our office is located in the West End neighborhood of Washington, DC.\n\nAre you up to the challenge?\n\nThis position requires comfort working with front-end development and web standards as well as backend technologies. Our developers thrive in a collaborative environment but also excel at solving challenges independently. We use many different technologies and operate in many different environments, and we work together with designers, analysts, stakeholders, and testers to build products as efficiently and effectively as possible. We also believe in perpetual self-improvement, and expect our employees to continue to work towards developing their own skills and the skills of those around them.",
    "applyUrl": "https://www.indeed.com/viewjob?jk=67bc3b2bb970485b&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "postedDate": "2025-07-31",
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTpL0KJMDNkimWIFiBMOAzLHq1yjyCBOWIgHwtz&s=0"
  },
  {
    "id": "api-1753972351618-4",
    "title": "Full Stack Application Developer (.NET, Azure, SQL, React, Node.js)",
    "company": "Ryder System",
    "location": "Washington",
    "type": "Full-time",
    "description": "Job Seekers can review the Job Applicant Privacy Policy by clicking here (http://ryder.com/job-applicant-privacy-policy) .\n\nJob Description :\n\nSummary\n\nThe Application Developer IV will actively and efficiently support all phases of the Agile software development and service delivery lifecycle – including but not limited to gathering and analyzing user requirements, collaborating with teammates to fully analyze specifications, developing and testing high-quality code, assisting in deployments, troubleshooting, responding to incidents/outages in a timely manner, modelling solutions, understanding data models, and documenting implementations.\n\nExperience Preferences\n\nScrum/Agile, MS VSTS and Azure DevOps boards, MS Azure and .NET environments, GIT, API-based solutions, Postman, Node.js, React, Storybook, Figma, swagger, CI/CD pipelines\n\nEssential Functions\n• Active participation in Agile practices, such as daily stand-ups, scrums, planning, and refinements\n• Coordinate and align with team leaders on detailed design decisions\n• Work with product owners to groom and optimize healthy feature backlogs (PBIs)\n• Consult with peer developers to foster consistency across teams and work efforts\n• Collaborate within development team to ensure designs are complete, updated, clear, consistent\n• Adhere to standards as conveyed by solution architects and tech team leads\n• Understand requirements and specs and translate to application features as conveyed by leads\n• Collaborate with dev and data teams and leads to set specs and strategize new implementations\n• Write high-quality enterprise-level code to develop/deliver application components on schedule\n• Seamlessly incorporate new features in existing applications while maintaining quality standards\n• Consistently follow software development best-practices and industry coding standards\n• Effectively test/validate features before QA/launch (unit, integration, functional, system, etc.)\n• Troubleshoot, debug, and resolve application errors, defects, and exceptions\n• Understand security protocols and perform regular security reviews and updates\n• Identify and correct bottlenecks, security threats, errors, and other defects and problems\n• Evaluate existing services, add features, refactor parts to improve performance or other aspects\n• Ensure the performance, quality, and responsiveness of implementations\n• Continuously discover ways to maximize development efficiency and quality\n• Accurately document all coding tasks and procedures for future maintenance, upgrades, and KT\n• Understand and work within the application development lifecycle\n• Remain up-to-date with technology trends, tools, platforms, best-practices\n• Provide 24x7 on-call support for Severity 1 issues, per duty roster with a root-cause/corrective action mindset; manage Service Level Agreements (SLAs) for Severity 2 and 3 support tickets\n\nAdditional Responsibilities\n• Develop and maintain technical specifications and design documentation – including but not limited to solution diagrams, flowcharts, context diagrams, data flow diagrams, checklists, migration plans, and core solution documentation for posterity and knowledge transfer\n• Provide comprehensive support to internal customers and peers to achieve resolution to outstanding problems and/or issues\n• Monitor application health by establishing and leveraging dashboards and alerts\n• Performs other duties as assigned\n\nSkills and Abilities\n• Ability to collect information, detect patterns, collaborate, brainstorm, interpret data, integrate new information, and theorize to solve problems and make effective decisions\n• Command of Microsoft tech stack – including but not limited to MS Azure and MS .NET development IDEs, tools, and environments, MS .NET Core and C#, MS SQL Server, RESTful APIs\n• Confidence and effectiveness with concepts and issues that lack certainty in clarity and structure\n• Strong verbal and written communication skills\n• Comfortable with and able to document and maintain technical specifications\n• High degrees of initiative, responsibility, accountability, teamwork, and collaboration skills\n\nQualifications\n• Bachelor's degree required in Computer Engineering or related field\n• Master's degree preferred in Computer Science or related field\n• Three (3) years or more Transportation Management and/or Distribution Management Technology preferred\n• Seven (7) years or more Software Development required\n\nTravel: 1-10%\n\nDOT Regulated: No\n\nJob Category: Application Development, Delivery & Support\n\nCompensation Information :\n\nThe compensation offered to a candidate may be influenced by a variety of factors, including the candidate’s relevant experience; education, including relevant degrees or certifications; work location; market data/ranges; internal equity; internal salary ranges; etc. The position may also be eligible to receive an annual bonus, commission, and/or long-term incentive plan based on the level and/or type. Compensation ranges for the position are below:\n\nPay Type :\n\nSalaried\n\nMinimum Pay Range:\n\n$110,000.00\n\nMaximum Pay Range:\n\n$120,000.00\n\nBenefits Information:\n\nFor all Full-time positions only : Ryder offers comprehensive health and welfare benefits, to include medical, prescription, dental, vision, life insurance and disability insurance options, as well as paid time off for vacation, illness, bereavement, family and parental leave, and a tax-advantaged 401(k) retirement savings plan.\n\nRyder is proud to be an Equal Opportunity Employer and Drug Free workplace.\n\nAll qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, sexual orientation, gender identity, age, status as a protected veteran, among other things, or status as a qualified individual with disability.\n\nSecurity Notice for Applicants:\n\nRyder will only communicate with an applicant directly from a [@ryder.com] email address and will never conduct an interview online through a chat type forum, messaging app (such as WhatsApp or Telegram), or via an online questionnaire. During an interview, Ryder will never ask for any form of payment or banking details and will never solicit personal information outside of the formal submitted application through www.ryder.com/careers .\n\nShould you have any questions regarding the application process or to verify the legitimacy of an interview or Ryder representative, please contact Ryder at careers@ryder.com or 800-793-3754.\n\nCurrent Employees :\n\nIf you are a current employee at Ryder, please click here (http://wd5.myworkday.com/ryder/d/task/1422$3.htmld) to log in to Workday to apply using the internal application process.\n\nJob Seekers can review the Job Applicant Privacy Policy by clicking here (http://ryder.com/job-applicant-privacy-policy) .\n\n#wd",
    "applyUrl": "https://jobs.ryder.com/washington-dc/full-stack-application-developer-net-azure-sql-react-nodejs/D648843B7DAC419E959EE9D000127F54/job/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "postedDate": "2025-07-31"
  },
  {
    "id": "api-1753972351618-5",
    "title": "Sr. React Developer Jobs",
    "company": "Arena Technical Resources",
    "location": "Washington",
    "type": "Full-time",
    "description": "Job Title: Sr React Developer\n\nJob Location: Washington, D.C. – Remote\n\nEligibility/Clearance: Secret Clearance preferred, the candidate will be\n\nrequired to obtain and maintain a Secret security clearance, depending\n\non the project requirements.\n\nJob Description:\n\nThe Senior React Developer will be responsible for creating robust and\n\nscalable web applications using React. This position will play a crucial\n\nrole in developing and optimizing the company's B2B applications and\n\nexperiences. As a Senior React Developer, you will have the opportunity\n\nto contribute to the development of cutting-edge AI platforms and shape\n\nthe user experience. Deep experience with Generative AI is strongly\n\npreferred.\n\nResponsibilities (include but are not limited to):\n\n• Collaborate with end users and stakeholders to understand requirements\n\nand translate them into high-quality, scalable web applications\n\n• Design and develop user interfaces using React, ensuring a seamless\n\nand engaging user experience\n\n• Optimize applications for maximum speed and scalability, with a focus\n\non simplicity and optimization to meet project requirements without\n\noverengineering solutions\n\n• Conduct code reviews and provide mentorship to junior developers\n\n• Work closely with UX designers to ensure the successful implementation\n\nof designs, providing guidance and support throughout the development\n\nprocess\n\n• Stay up-to-date with industry trends and best practices in React\n\ndevelopment, incorporating them into the full-scope development process\n\nwith other team members\n\n• Collaborate with backend developers to integrate user-facing elements\n\nwith serverside logic\n\n• Use modern development tools and frameworks to create high-quality\n\ncode and interactive prototypes\n\n• Ensure the technical feasibility of UI/UX designs\n\nRequirements:\n\n• 5+ years of experience as a React Developer, with the ability to\n\nprovide examples showcasing expertise in building complex web\n\napplications\n\n• Proficiency in JavaScript and React.js\n\n• Experience in optimizing applications for complex B2B environments,\n\nensuring streamlined solutions that avoid unnecessary complexity or\n\nredundant features\n\n• Strong understanding of responsive design principles and the ability\n\nto create interfaces that work seamlessly across different devices and\n\nscreen sizes\n\n• Familiarity with HTML5 and CSS3\n\n• Strong problem-solving skills and the ability to think critically\n\nabout user needs and technical challenges\n\n• Excellent communication and collaboration skills, with the ability to\n\nwork effectively in cross-functional teams\n\n• A passion for clean code, user-centered design, and a strong attention\n\nto detail\n\n• Relevant certifications in Python development or related fields are a\n\nplus.\n\nEducation:\n\n• Must have Bachelor’s Degree in a technology related discipline\n\nArena Technical Resources, LLC, (ATR) is an Equal Opportunity Employer\n\n(EOE) who will provide equal employment opportunity to employees and\n\napplicants for employment without regard to race, ethnicity, religion,\n\ncolor, sex, pregnancy, national origin, age, veteran status, ancestry,\n\nsexual orientation, gender identity or expression, marital status,\n\nfamily structure, genetic information, or mental or physical disability",
    "applyUrl": "https://www.clearancejobs.com/jobs/8454745/sr-react-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "postedDate": "2025-07-29"
  },
  {
    "id": "api-1753972351618-6",
    "title": "React Developer",
    "company": "Insight Global",
    "location": "Arlington",
    "type": "Full-time and Contractor",
    "description": "This developer will participate in building and modernizing web-based applications to support our projects, work with technical leads to develop and enforce standards, collaborate with a development team, and follow solutions as they are developed through production deployment. The team performs custom software development to modernize siloed, legacy applications using modular design standards. The team works closely with clients and other contractors to ensure the performance and reliability of public-facing, mission-critical applications.\n\nWhat you'll be doing:\n• Identifies requirements by establishing personal rapport with potential and actual clients and with other persons in a position to understand service requirements\n• Develops and maintains applications and databases by evaluating client needs; analyzing requirements; developing software systems\n• Bug fixing, browser testing, accessibility testing\n• Documenting code and processes\n• Collaborate with designers, developers, and project managers on client work\n• Communicating with co-workers about your projects and tasks\n• Actively participate in project discussions and team meetings (e.g., daily standups, code reviews)",
    "applyUrl": "https://jobs.insightglobal.com/find_a_job/virginia/job-318103/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "postedDate": "2025-07-31"
  },
  {
    "id": "api-1753972351618-7",
    "title": "Senior React Developer | ReactJS | UI ReactJS",
    "company": "Resource Informatics Group",
    "location": "Washington",
    "type": "Contractor",
    "description": "Job Title: Senior React Developer\nLocation: Washington DC\nDuration: 9-12 months\nOpenings: 2\nJob Type: Contract\nNeed Local Professionals\n\nClient interviewed few resources but none of them qualified and not strong on React.\n\nJob Summary:\nWe are seeking a highly skilled and experienced Senior React Developer to join our team. The ideal candidate will have a strong background in building dynamic, responsive web applications using React 18, Redux Toolkit, and JavaScript, with additional experience in Node.js. As a Senior Developer, you will collaborate closely with cross-functional teams to design and implement efficient, scalable solutions and guide best practices for front-end development.\n\nKey Responsibilities:\n• Develop and maintain user interfaces using React 18, Redux Toolkit, and hooks.\n• Build reusable components and front-end libraries for future use.\n• Optimize applications for maximum speed and scalability.\n• Collaborate with UX/UI designers, back-end developers, and other team members to create seamless user experiences.\n• Write clean, maintainable, and efficient code.\n• Debug and resolve technical issues in a timely manner.\n• Review code and mentor junior developers to improve code quality and adherence to best practices.\n• Stay updated with emerging trends and technologies in front-end development.\n\nRequirements:\n• Bachelor's degree in Computer Science, Engineering, or a related field (or equivalent experience).\n• 8+ years of experience in front-end development, with expertise in React 18, Redux Toolkit, and hooks.\n• Strong proficiency in JavaScript, including ES6+ features.\n• Experience with Node.js and server-side development is a plus.\n• Solid understanding of responsive design, CSS, and cross-browser compatibility.\n• Familiarity with RESTful APIs and asynchronous request handling.\n• Knowledge of Git version control.\n• Strong problem-solving skills and attention to detail.\n• Excellent communication skills and a collaborative attitude.\n\nNice to Have:\n• Experience with TypeScript.\n• Familiarity with testing frameworks like Jest or Enzyme.\n• Previous experience working in agile or scrum environments.",
    "applyUrl": "https://www.dice.com/job-detail/3b5a4db8-9b42-49f4-8e38-5b12570297c0?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "postedDate": "2025-07-28"
  },
  {
    "id": "api-1753972351618-8",
    "title": "11+ Years React JS Developer - (Onsite - In-person interview)",
    "company": "AHU Technologies Inc",
    "location": "Washington",
    "type": "Full-time",
    "description": "Role :React JS Developer\n\nClient : DC Government\n\nLocation : Washington DC (Onsite)\n\nJob Description:\n\nSkills:\n\n· 6+ years of Enterprise Web Development experience\n\n· 2 years of experience in working with React-UI framework (React.js)\n\n· Experience in working with ReactJS, RXJS, NodeJS, ES6/5\n\n· Experience in REDUX architecture\n\n· Experience in working with HTML5, CSS3, JavaScript, Angular 2.0, React.JS and Bootstrap\n\n· Experience in developing React Native components\n\n· Experience in working with JSX (Javascript Syntax Extension)\n\n· Experience in working with REST APIs\n\n· Experience in working with JSON and XML\n\n· Experience to translate Wireframes and designs for development\n\n· Experience in CSS libraries, Sigma, Adobe XD\n\n· Experience in working with Angular 2.0 is a big plus\n\n· Experience in working with Spring Boot and Spring Technologies is a plus\n\n· Experience in working with any REACT based UI toolkit is a plus\n\n· Experience with ReactJS workflows like Flux, Redux, Create React App, data structure libraries\n\n· Experience with GIT version control repository [Required – 3 Years]\n\n· Experience with Tomcat/Jetty/undertow Application Servers [Required – 3 Years]\n\nExperience with LINUX working environment [Required – 3 Years]\n\nExperience with JIRA Issue tracker [Required – 3 Years]\n\nRedHat Openshift Container-based application development and deployment experience [Desirable]\n\nKnowledge of Continuous Integration and Continuous Development practice [Desirable]\n\nResponsibilities:\n\nThe Senior React Developer position requires in-depth knowledge of JavaScript, object model, DOM manipulation and event handlers, data structures, algorithms, JSX, Babel, and architectural styles /API’s (REST/RPC) and Agile methodologies for the development of application programs.\n\nThe Senior Developer will be writing clean, scalable code using ReactJS programming languages, refactor and debug codes, improve existing software, test, and deploy applications and systems. Develop documentation throughout the lifecycle of the development process and provide technical support to the team.\n\n· E Ensure that the technologies are updated with current, stable, and compliant architecture and applications that meet enterprise standards.\n\n· Collaborate with internal teams to produce software design and architecture\n\n· Develop, Test and Deploy applications and systems\n\n· Revise, update, refactor and debug codes\n\n· Improve existing JAVA applications and systems\n\n· Proactively monitors and reports performance utilization of assigned technologies.\n\n· Troubleshoot software and/or hardware issues/failures.\n\n· Manage problem or escalated tickets and tasks and out of cycle requests from systems/software owners.\n\n· Determine the best course of action for meeting business needs and provide consultative expertise to customers on how to best use systems.\n\n· Proactively monitors and identifies broader, more complex issues across multiple, integrated, connecting technologies and communicate as appropriate.\n\n· Provides technical knowledge and support to District agencies, personnel, and additional stakeholders\n\n· Performs other related duties as assigned\n\n· May coordinate activities of application developers.\n\n· Able to identify best practices and standards for the use of the product.\n\n· Delivers support and design for industry specific applications that require integration with statewide systems or applications\n\n· Interacts with executive level business users or technical experts\n\n· May function as a niche technical SME (Subject Matter Expert)",
    "applyUrl": "https://ahu-technologies-inc.careerplug.com/jobs/2820828?utm_id=3660819&utm_source=React+JS+Developer+Jobs&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "postedDate": "2025-07-31",
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQPYx7Z01xH1bFpBmnLeH3bIVcOPaWii4VHtd1Y&s=0"
  },
  {
    "id": "api-1753972351618-9",
    "title": "Software Developer (Full Stack - Python, React)",
    "company": "U.S. News & World Report",
    "location": "Washington",
    "type": "Full-time",
    "description": "Description\n\nU.S. News & World Report is a multifaceted digital media company dedicated to helping citizens, consumers, business leaders and policy officials make important decisions in their lives. We publish independent reporting, rankings, data journalism and advice that has earned the trust of our readers and users for over 90 years. Our platforms on usnews.com include Education, Health, Money, Travel, Cars, News and 360 Reviews.\n\nWe reach millions of people monthly during moments when they are most in need of expert advice and motivated to act on that advice directly on our platforms. Our signature franchises include our \"Best\" series of consumer guides on colleges, graduate schools, hospitals, diets, cars, financial services and more. These guides provide an easy-to-digest list for consumers to better understand and compare when making their decisions. We continue to publish annual guides of the authoritative Best Colleges and Best Hospitals rankings on our website and in print. And our U.S. News Live flagship conferences highlight important national conversations including Healthcare of Tomorrow and Healthiest Communities.\n\nWe believe in having a broad range of talent and backgrounds at U.S. News. We strive to maintain a welcoming workplace where everyone is given an opportunity to succeed and contribute to their fullest. Learn more about our Diversity, Equity and Inclusion initiative.\n\nYour role in helping us shape the future:\n\nWe are looking for an enthusiastic full stack Software Developer with an interest in building dynamic, data-driven products.\n\nU.S. News empowers everyone to thrive. The developers at U.S. News have a great deal of independence and a minimum of overhead. By leveraging React.js, Python, AWS cloud, Google BigQuery, data science and other latest technologies, you'll be driving a major transformation within U.S. News.\n\nThe successful candidate will become an influential member of a passionate, friendly, and growing team that creates web applications which reach millions of visitors monthly. Developers typically see applications through from beginning to end, working directly with project owners to create, implement, upgrade, optimize, and test features and projects.\n\nWe offer a casual, flexible, hybrid-remote work environment. Our office is located in the West End neighborhood of Washington, DC.\n\nAre you up to the challenge?\n\nThis position requires comfort working with front-end development and web standards as well as backend technologies. Our developers thrive in a collaborative environment but also excel at solving challenges independently. We use many different technologies and operate in many different environments, and we work together with designers, analysts, stakeholders, and testers to build products as efficiently and effectively as possible. We also believe in perpetual self-improvement, and expect our employees to continue to work towards developing their own skills and the skills of those around them.\n\nPosition Requirements\n\nYou should definitely have:\n• Minimum two years of related or similar full stack experience\n• A Bachelor's degree in computer science or related field\n• Modern JavaScript frameworks, such as React\n• Web styling with CSS preprocessors or CSS-in-JS\n• Modern JavaScript patterns and ES6\n• Server-side technologies, such as Python, Java, or NodeJS\n• Databases, such as PostgreSQL\n• Unix-based operating systems, such as Linux or Mac OS X, along with the shells and command-line tools available in those environments\n• Version control, such as Git\n\nIt would be nice if you had:\n• CICD pipelines such as Jenkins\n• Cloud environments such as AWS\n• Data ingestion/transformation\n\nWhat it's like to work with us:\n\nTalent is our best asset!\n\nWe invest in people with passion and potential who understand U.S. News' dedication to our consumers.\n• Entrepreneurial, mission-driven culture with core values of quality and integrity\n• Focus on fostering personal and professional growth\n• Competitive benefits including paid vacation time, medical, tuition reimbursement, and training\n• Collaborative Work Environment ~ Fun, diverse, inclusive and ambitious co-workers\n\nOther Job Info:\n• These statements are intended to describe the general nature and level of work being performed by employees assigned to this job. This is not intended to be an exhaustive list of all responsibilities, duties, and skills required of employees assigned to this job.\n• U.S. News & World Report strongly encourages all employees to be fully vaccinated (including boosters).\n• Strong preference for New York or Washington, DC based applicants to work a hybrid schedule in those office locations. Remote applicants will be considered.\n• The anticipated base salary for this position is $80,000 to $130,000. The actual base salary offered will depend on a variety of factors, including without limitation, the qualifications of the individual applicant for the position, years of relevant experience, level of education attained, certifications or other professional licenses held, interview performance, and if applicable, the location in which the applicant lives and/or from which they will be performing the job.\n\nFull-Time/Part-Time\nFull-Time\n\nNumber of Openings\n1\n\nAbout the Organization\nU.S. News & World Report is a publisher of news and information that empowers people to make better, more informed decisions about important issues affecting their lives.\n\nEOE Statement\nWe are an equal employment opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status or any other characteristic protected by law.\n\nTags\n\nThis position is currently accepting applications.",
    "applyUrl": "https://www.ziprecruiter.com/c/U.S.-News-&-World-Report/Job/Software-Developer-(Full-Stack-Python,-React)/-in-Washington,DC?jid=9fd4e2d68d4cbba0&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "postedDate": "2025-07-31",
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRf6YrxR64i9zZj__r3vspWtzEJ44W2EF4u4mXY&s=0"
  }
]