[
  {
    "id": "api-1754050921524-0",
    "title": "React Developer",
    "company": "Go Intellects Inc",
    "location": "Washington",
    "type": "Full-time",
    "description": "Benefits:\n• Competitive salary\n\nJob Description:\n\n6-10 years of experience as a SME/Developer in complex enterprise level developer projects. Provides assessments of technical and operational practices based on leading industry standards specific to the requested technology.\n\nThe ideal candidate will be able to work both independently and as part of a team of consultants to provide these services and will have the following skills/capabilities:\n• Interact with clients to understand complex business requirements\n• Create functional requirement and design for customizations\n• Accurately estimate level of effort for implementation tasks\n• Review developer proposed implementation and identify efficient designs\n• Work with Delivery architects, Technical Leads and developers to ensure access and security profiles meet the needs of the Agency, including verifying that the policies/restrictions in place.\n• Collaborate with Delivery architects, Technical Leads and developers to perform code reviews\n• Excellent written and oral English communication and presentation skills.\n\nEducation And Professional Qualifications\n• 4+ years’ experience implementing, developing, supporting and maintaining React applications\n• Strong teamwork and interpersonal skills\n• At least 2 years experience in Next.js (Required)\n• Ability to develop effective working relationships with all levels of personnel\n• Strong client-service orientation and focus\n• Thorough attention to detail and a strong desire to deliver the highest quality solutions to CFSAs\n• Experience across a variety of industries\n\nMinimum Education/Certification Requirements:\n• Bachelor’s degree in Information Technology or related field or equivalent experience ,the candidate may occasionally be asked to attend in-person meetings.\n\nFlexible work from home options available.",
    "applyUrl": "https://www.linkedin.com/jobs/view/react-developer-at-go-intellects-inc-4274223275?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "postedDate": "2025-07-31",
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQNVQCcHNvOWnHJfC0B7yenAHhbBeiszDqAV-6w&s=0"
  },
  {
    "id": "api-1754050921524-1",
    "title": "Junior Software Developer (Full Stack - Python, React)",
    "company": "Jobright.ai",
    "location": "Washington",
    "type": "Full-time",
    "description": "Verified Job On Employer Career Site\n\nJob Summary:\n\nU.S. News & World Report is a multifaceted digital media company dedicated to helping citizens make important decisions. They are seeking an enthusiastic full stack Software Developer to build dynamic, data-driven products and create web applications that reach millions of visitors monthly.\n\nResponsibilities:\n\n• Create, implement, upgrade, optimize, and test features and projects.\n\n• Work directly with project owners.\n\n• Collaborate with designers, analysts, stakeholders, and testers.\n\n• Drive a major transformation within U.S. News.\n\nQualifications:\n\nRequired:\n\n• Minimum two years of related or similar full stack experience\n\n• A Bachelor’s degree in computer science or related field\n\n• Modern JavaScript frameworks, such as React\n\n• Web styling with CSS preprocessors or CSS-in-JS\n\n• Modern JavaScript patterns and ES6\n\n• Server-side technologies, such as Python, Java, or NodeJS\n\n• Databases, such as PostgreSQL\n\n• Unix-based operating systems, such as Linux or Mac OS X, along with the shells and command-line tools available in those environments\n\n• Version control, such as Git\n\nPreferred:\n\n• CICD pipelines such as Jenkins\n\n• Cloud environments such as AWS\n\n• Data ingestion/transformation\n\nCompany:\n\nU.S. News & World Report is an American media company that publishes consumer advice, rankings, and analysis. Founded in 1933, the company is headquartered in Washington, District of Columbia, USA, with a team of 501-1000 employees. The company is currently Late Stage. U.S. News & World Report has a track record of offering H1B sponsorships.",
    "applyUrl": "https://www.linkedin.com/jobs/view/junior-software-developer-full-stack-python-react-at-jobright-ai-4276891130?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "postedDate": "2025-07-31",
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRc11c46XEF7nUag98qauGWM3tBuQH8ELcz8Cbg&s=0"
  },
  {
    "id": "api-1754050921524-2",
    "title": "React Developer",
    "company": "Go intellects Inc",
    "location": "Hillcrest Heights",
    "type": "Full-time",
    "description": "Benefits:\n• Competitive salary\n\nJob Description:\n6-10 years of experience as a SME/Developer in complex enterprise level developer projects. Provides assessments of technical and operational practices based on leading industry standards specific to the requested technology.\n\nThe ideal candidate will be able to work both independently and as part of a team of consultants to provide these services and will have the following skills/capabilities:\n• Interact with clients to understand complex business requirements\n• Create functional requirement and design for customizations\n• Accurately estimate level of effort for implementation tasks\n• Review developer proposed implementation and identify efficient designs\n• Work with Delivery architects, Technical Leads and developers to ensure access and security profiles meet the needs of the Agency, including verifying that the policies/restrictions in place.\n• Collaborate with Delivery architects, Technical Leads and developers to perform code reviews\n• Excellent written and oral English communication and presentation skills.\n\nEducation and Professional Qualifications\n• 4+ years’ experience implementing, developing, supporting and maintaining React applications\n• Strong teamwork and interpersonal skills\n• At least 2 years experience in Next.js (Required)\n• Ability to develop effective working relationships with all levels of personnel\n• Strong client-service orientation and focus\n• Thorough attention to detail and a strong desire to deliver the highest quality solutions to CFSAs\n• Experience across a variety of industries\n\nMinimum Education/Certification Requirements:\n• Bachelor’s degree in Information Technology or related field or equivalent experience ,the candidate may occasionally be asked to attend in-person meetings.\n\nFlexible work from home options available.",
    "applyUrl": "https://www.adzuna.com/details/5329993818?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "postedDate": "2025-07-31"
  },
  {
    "id": "api-1754050921524-3",
    "title": "AEM UI developer- React JS",
    "company": "Capgemini",
    "location": "Washington",
    "type": "Full-time",
    "description": "About the job you’re considering\n\nThe role requires React JS development experience with AEM UI exp.\n\nYour role\n• Develop and maintain responsive, high-performance web applications using ReactJS, adhering to the client React/JSX Style Guide.\n• integrating with AEM Content Fragments via GraphQL and REST APIs.\n• Instrument React applications with the Adobe Universal Editor for headless/headful content editing, ensuring seamless integration with AEM.\n• Build custom applications and extensions using Adobe AEM App Builder to manage content fragments and enhance user experiences.\n• Collaborate with backend teams to integrate with Node.js/Express servers and Apigee APIs\n• Optimize frontend performance and ensure cross-browser compatibility\n• Participate in code reviews, testing, and deployment within an Agile environment, utilizing monitoring tools like Application Insights and Splunk.\n\nYour skills and experience\n• Proficient in JavaScript (ES6+) and ReactJS.\n• Knowledge of Node.js and Express for backend integration.\n• Experience with Next.js (SSR/SSG) is a strong plus.\n• Hands-on experience with AEM Content Fragments, GraphQL, and REST APIs.\n• Proficiency with Adobe Universal Editor for content editing in React apps.\n• Familiarity with Adobe AEM App Builder for custom app development.\n• Experience with Azure cloud services (App Services) and Akamai CDN.\n• Understanding of API consumption (GraphQL, RESTful, OAuth).\n• Strong CSS/HTML skills for responsive and accessible design.\n• Ability to debug, optimize, and test frontend performance.\n• Experience with version control (e.g., Git) and CI/CD pipelines.\n• Preferable skills in server-side rendering (SSR) and static site generation (SSG) using frameworks like Next.js,\n• Excellent problem-solving, communication, and collaboration skills.\n• Ability to work effectively in a team and adapt to new tools.\n\n#LI-MS4 #LI-ONSITE\n\nLife at Capgemini\n\nCapgemini supports all aspects of your well-being throughout the changing stages of your life and career. For eligible employees, we offer:\n• Flexible work\n• Healthcare including dental, vision, mental health, and well-being programs\n• Financial well-being programs such as 401(k) and Employee Share Ownership Plan\n• Paid time off and paid holidays\n• Paid parental leave\n• Family building benefits like adoption assistance, surrogacy, and cryopreservation\n• Social well-being benefits like subsidized back-up child/elder care and tutoring\n• Mentoring, coaching and learning programs\n• Employee Resource Groups\n• Disaster Relief\n\nAbout Capgemini\n\nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to\nengineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion.\n\nGet the future you want | www.capgemini.com\n\nDisclaimer\n\nCapgemini is an Equal Opportunity Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to race, national origin, gender identity/expression, age, religion, disability, sexual orientation, genetics, veteran status, marital status or any other characteristic protected by law.\n\nThis is a general description of the Duties, Responsibilities and Qualifications required for this position. Physical, mental, sensory or environmental demands may be referenced in an attempt to communicate the manner in which this position traditionally is performed. Whenever necessary to provide individuals with disabilities an equal employment opportunity, Capgemini will consider reasonable accommodations that might involve varying job requirements and/or changing the way this job is performed, provided that such accommodations do not pose an undue hardship.\n\nCapgemini is committed to providing reasonable accommodations during our recruitment process. If you need assistance or accommodation, please reach out to your recruiting contact.\n\nPlease be aware that Capgemini may capture your image (video or screenshot) during the interview process and that image may be used for verification, including during the hiring and onboarding process.\n\nClick the following link for more information on your rights as an Applicant http://www.capgemini.com/resources/equal-employment-opportunity-is-the-law\n\nApplicants for employment in the US must have valid work authorization that does not now and/or will not in the future require sponsorship of a visa for employment authorization in the US by Capgemini.\n\nCapgemini discloses salary range information in compliance with state and local pay transparency obligations. The disclosed range represents the lowest to highest salary we, in good faith, believe we would pay for this role at the time of this posting, although we may ultimately pay more or less than the disclosed range, and the range may be modified in the future. The disclosed range takes into account the wide range of factors that are considered in making compensation decisions including, but not limited to, geographic location, relevant education, qualifications, certifications, experience, skills, seniority, performance, sales or revenue-based metrics, and business or organizational needs. At Capgemini, it is not typical for an individual to be hired at or near the top of the range for their role. The base salary range for the tagged location is $76,200 - $178,290. This role may be eligible for other compensation including variable compensation, bonus, or commission. Full time regular employees are eligible for paid time off, medical/dental/vision insurance, 401(k), and any other benefits to eligible employees. Note: No amount of pay is considered to be wages or compensation until such amount is earned, vested, and determinable. The amount and availability of any bonus, commission, or any other form of compensation that are allocable to a particular employee remains in the Company's sole discretion unless and until paid and may be modified at the Company’s sole discretion, consistent with the law.",
    "applyUrl": "https://www.indeed.com/viewjob?jk=5e3751446bd43f43&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "postedDate": "2025-07-10",
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT5sgZoGfYI1XsIKjrk-ZrHWEbst6ThTBSeIZcL&s=0"
  },
  {
    "id": "api-1754050921524-4",
    "title": "React Software Developer – PostgreSQL AWS",
    "company": "Peraton",
    "location": "Washington",
    "type": "Full-time",
    "description": "Qualifications:\n• A current Top Secret security clearance with SCI eligibility and the ability to obtain a polygraph.\n• 4 years with AS/AA; 2 years with BS/BA; 0 years with MS/MA; 6 years with no degree.\n• Experience with implementing and using GitHub for CI/CD pipelines and DevSecOps deployments.\n• Experience with microservices, virtualization, and containerized deployments.\n• Experience with in React, Java, Javascript, Spring Boot in Visual Studio IDE.\n• Experience with SQL Server and PostgreSQL database technologies.\n\nPeraton offers enhanced benefits to employees working on this critical National Security program, which include heavily subsidized employee benefits coverage for you and your dependents, 25 days of PTO accrued annually up to a generous PTO cap and eligibility to participate in an attractive bonus plan.\n\nTechnology is constantly changing, and our adversaries are digitally exceeding law enforcement’s ability to keep pace. Those charged with protecting the United States are not always able to access the evidence needed to prosecute crime and prevent terrorism. The Government has trusted in Peraton to provide the technical ability, tools, and resources to bring criminals to justice. In response to this challenge, Peraton is seeking skilled Full Stack Software Developers to develop a dynamic forms, web-based, application in a React, Node.JS and AWS environment.\n\nResponsibilities:\n• Design, test, and develop well designed web based software coding that is testable and efficient by using best software development practices to meet user’s needs using tools like React, AWS, Postgres, and others\n• Translate the UI/UX design wireframes, ensuring software continues to function normally through software maintenance and testing; and documenting every aspects of the application, service or environment as a reference for future maintenance and upgrades.\n• Collaborate with customers and technical resources to translate requirements into Epics, Features, and User Stories for functional and non-functional requirements.\n• Support Agile teams in Backlog planning, work item refinement, and story point analysis.\n• Ensure User Stories have well-defined acceptance criteria.\n• Demonstrate work completed in a sprint to the customer.\n• Design software and solutions using industry standard design patterns and best practices.\n• Apply coding standards that support secure coding practices.\n• Develop automated unit and integration tests for continuous integration and delivery (CI/CD) pipelines.",
    "applyUrl": "https://www.careers.peraton.com/jobs/react-software-developer-postgre-sql-aws-washington-d-c-158428-jobs--information-technology--?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "postedDate": "2025-07-24",
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRBOOXkmAgPSspVuh7SLtB570s8UdY-B1WvbTtL&s=0"
  },
  {
    "id": "api-1754050921524-5",
    "title": "Senior Full Stack React Developer (On-Site)",
    "company": "Lion Federal",
    "location": "Falls Church",
    "type": "Full-time",
    "description": "Senior Full Stack React Developer\n\nJob Type: On-site, full-time\n\nCity: Falls Church\n\nState/Province: Virginia\n\nLion Federal is a dynamic and rapidly expanding tech company dedicated to delivering cutting-edge AI-powered solutions tailored for enterprise-level clients, including the U.S. Federal government.\n\nAt Lion Federal, we believe our team is the heartbeat of our success. We’ve built an environment where your growth is nurtured, and your voice truly matters. Here, you’ll enjoy all the benefits of a large company, along with some rare perks that set us apart:\n• Build genuine connections with team members at all levels\n• Get quick, meaningful responses from leadership who genuinely care\n• Feel a true sense of ownership, because your insights and feedback shape the future of our company\n\nWe are seeking a highly motivated and experienced Senior Full Stack React Developer to join our dynamic team in Falls Church, VA.\n\nPosition Summary:\n\nIn this role, you will be responsible for both front-end and back-end development, working on building a scalable and efficient platform for enterprise clients. You will collaborate closely with our API and AI development teams to ensure seamless integration and optimal performance. The ideal candidate should be self-driven and capable of delivering robust, high-quality code in a fast-paced environment.\n\nKey Responsibilities:\n• Lead the design, development, and deployment of full-stack web applications using React (front-end) and Node.js, Python, or other relevant back-end technologies.\n• Build and optimize APIs and services for performance, scalability, and security.\n• Collaborate with back-end and AI/ML teams to integrate APIs, databases, and AI-driven services.\n• Ensure the platform is scalable, secure, and optimized for performance, both on the front end and back end.\n• Write clean, maintainable, and well-documented code.\n• Participate in the full software development lifecycle, including code reviews, testing, and continuous deployment.\n• Take ownership of the product lifecycle, ensuring MVPs are delivered quickly to meet business deadlines.\n• Stay up-to-date with industry trends and emerging technologies to ensure our platform stays at the forefront of innovation.\n\nRequirements\n\nRequirements:\n• 5+ years of professional experience in full-stack development with a strong focus on React for front-end development.\n• Proficiency in front-end technologies like JavaScript/TypeScript, HTML5, CSS3, and state management libraries (Redux, Context API).\n• Expertise in back-end technologies like Node.js, Python, or similar, along with experience in building RESTful APIs.\n• Strong understanding of database systems (SQL, NoSQL) and cloud infrastructure (AWS, Azure, Google Cloud).\n• Familiarity with version control tools like Git and CI/CD pipelines.\n• Experience with containerization tools (Docker) and cloud deployment (Kubernetes) is a plus.\n• Excellent communication and problem-solving skills.\n• Self-starter with a passion for innovation and delivering high-quality products.\n\nNice-to-Haves:\n• Experience with AI/ML technologies, particularly Generative AI or LLMs.\n• Exposure to cloud platforms such as AWS, Azure, or Google Cloud.\n• Knowledge of DevOps practices and cloud infrastructure management.\n\nBenefits\n\nWhy Join Us?\n• Be a key player in building innovative AI-driven solutions for enterprise clients.\n• Collaborate with a team of experienced developers and AI experts.\n• Competitive salary and benefits package.\n• Opportunity to make a significant impact and shape the future of our product.\n\nBenefits:\n• Comprehensive CareFirst BCBS Medical, Dental, and Vision insurance fully covered for you and your family\n• Supportive team environment with outstanding leadership that values employee well-being\n• Generous paid time off, plus 11 paid holidays\n• 401(k) retirement plan with employer match\n• Performance-driven bonus program\n• Budget allocated for professional development and growth",
    "applyUrl": "https://www.indeed.com/viewjob?jk=5f515c2eee9e24eb&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "postedDate": "2025-08-01"
  },
  {
    "id": "api-1754050921524-6",
    "title": "Java Full Stack Developer with React-Focused. (Need Independent Candidate)",
    "company": "Jobs via Dice",
    "location": "Oakton",
    "type": "Full-time",
    "description": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, ATA ANALYTIQ LLC, is seeking the following. Apply via Dice today!\n\nJob Description:\n\nRole: Java Full Stack Developer with React-Focused | RESTful APIs | microservices | Minimal Angular.\n\nBack End Strong PL/SQL and Oracle .\n\nLocation: -100% onsite position. Location: Oakton , VA & Middletown, NJ.\n\n10+ Years\n\nOnly W2.\n\ninterview Process:\n• After Recruiter Phone Screen- Make sure candidate can work onsite 5 days in Middletown, NJ or Oakton, VA. Must be able to go for Final Round interview F2F. There will be a technical screening from Orion Team and then a Panel with AT&T both will be on Teams.\n• Move candidate to HMR and I will send to Orion Team to review resumes.\n• Based on resume moving forward I will schedule the Teams call and keep you posted on next steps to communicate with your candidates.",
    "applyUrl": "https://www.linkedin.com/jobs/view/java-full-stack-developer-with-react-focused-need-independent-candidate-at-jobs-via-dice-4276869044?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "postedDate": "2025-07-31",
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR9CC1NlnLA7sshF1s1dqKvk8U495jsMwImnyPP&s=0"
  },
  {
    "id": "api-1754050921524-7",
    "title": "React / UI Developer",
    "company": "Parsons Corporation",
    "location": "Centreville",
    "type": "Full-time",
    "description": "In a world of possibilities, pursue one with endless opportunities. Imagine Next!\n\nWhen it comes to what you want in your career, if you can imagine it, you can do it at Parsons. Imagine a career working with exceptional people sharing a common quest. Imagine a workplace where you can be yourself. Where you can thrive. Where you can find your next, right now. We’ve got what you’re looking for.\n\nJob Description:\n\nJoin Our Team as a Senior React Front-End Developer at Parsons!\n\nAre you a passionate and innovative front-end developer looking to make a global impact? Parsons is seeking a Senior React Front-End Developer to join our dynamic and talented product development team. In this role, you’ll play a pivotal part in designing and implementing cutting-edge application features that support transportation customers worldwide. You’ll also have the unique opportunity to shape front-end development practices across multiple projects within Parsons, driving innovation and excellence.\n\nWhy Join Us?\n\nAt Parsons, we’re not just building software—we’re shaping the future of transportation. As part of our team, you’ll work on meaningful projects that make a difference, collaborate with top-tier talent, and have the freedom to bring your ideas to life. If you’re ready to push boundaries and grow your career, this is the place for you.\n\nWhat You’ll Do:\n• Collaborate with stakeholders to understand project scope and translate requirements into actionable work items.\n• Provide accurate estimates for project requirements and enhancement requests.\n• Partner with the lead engineer to propose innovative solutions, approaches, and designs that meet customer needs.\n• Enhance user experiences by leveraging modern UI frameworks like Material UI.\n• Design and rapidly prototype front-end solutions using React , ensuring alignment with requirements and team ideation.\n• Develop, implement, test, and debug application UIs using React, HTML, and CSS .\n• Work closely with backend developers to define REST API requirements.\n• Actively participate in SCRUM team activities to ensure successful project delivery.\n• Operate at an advanced technical level, demonstrating expertise in all phases of application systems analysis and programming.\n\nRequired Skills:\n• Expertise in web and API frameworks, including React JS, Spring Boot, Angular, REST, HTML5, JavaScript, jQuery, CSS, XML, JSON, JSP, and Servlets .\n• Strong experience with front-end unit testing paradigms.\n• Proven ability to design React application architectures, including state management, server-sent data flows, authentication/authorization, and REST API integrations.\n• Familiarity with tools like Ant, Gradle, Maven, Git , and Atlassian products (Confluence, JIRA, Bitbucket).\n• Knowledge of DevOps and Continuous Integration concepts and toolsets.\n• Experience interfacing with backend applications using RESTful web services and message queues.\n• Proficiency in modern IDEs such as VS Code, Eclipse, or IntelliJ .\n• Hands-on experience in Windows, Linux, or Unix development and production environments.\n\nDesired Skills:\n• Experience with application/web server environments like Spring Boot, Wildfly/JBoss, Tomcat, or IIS .\n• Familiarity with big data tools, reporting/dashboarding platforms like Jaspersoft, PowerBI , or big data analytics.\n• Knowledge of cloud-based managed services such as Azure or AWS .\n• Understanding of relational databases like SQL Server, MySQL, or Oracle .\n• Experience with UI prototyping tools such as Figma .\n\nWhat We’re Looking For:\n• A Bachelor’s degree in a relevant field and 8+ years of professional experience . An advanced degree is a plus.\n• A proactive, solutions-oriented mindset with a passion for creating exceptional user experiences.\n• A collaborative team player who thrives in a fast-paced, agile environment.\n\nWhy Parsons?\n\nAt Parsons, we believe in empowering our employees to do their best work. We offer a supportive and inclusive culture, opportunities for professional growth, and the chance to work on projects that truly matter. Join us, and let’s build the future together.\n\nReady to make an impact? Apply today and become part of a team that’s transforming the world of transportation!\n\nSecurity Clearance Requirement:\n\nNone\n\nThis position is part of our Critical Infrastructure team.\n\nFor more than 80 years, our experts have designed and delivered the critical infrastructure that connects and protects communities around the world. We work in collaborative teams, both within the company and with our partners and customers, to plan, design, build, and modernize infrastructure. We take special pride in projects and solutions that improve communities as well as people’s quality of life by promoting economic growth, enhancing mobility, and increasing sustainability and resiliency. Powered by our people, we provide the imagination necessary to support our customers’ visions—and to help them see what's next!\n\nSalary Range: $100,900.00 - $176,600.00\n\nWe value our employees and want our employees to take care of their overall wellbeing, which is why we offer best-in-class benefits such as medical, dental, vision, paid time off, Employee Stock Ownership Plan (ESOP), 401(k), life insurance, flexible work schedules, and holidays to fit your busy lifestyle!\n\nThis position will be posted for a minimum of 3 days and will continue to be posted for an average of 30 days until a qualified applicant is selected or the position has been cancelled.\n\nParsons is an equal opportunity employer, and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, veteran status or any other protected status.\n\nWe truly invest and care about our employee’s wellbeing and provide endless growth opportunities as the sky is the limit, so aim for the stars! Imagine next and join the Parsons quest—APPLY TODAY!\n\nParsons is aware of fraudulent recruitment practices. To learn more about recruitment fraud and how to report it, please refer to https://www.parsons.com/fraudulent-recruitment/ .\n\nAbout Us\n\nParsons is a digitally enabled solutions provider focused on the defense, security, and infrastructure markets. With nearly 75 years of experience, Parsons is uniquely qualified to deliver cyber/converged security, technology-based intellectual property, and other innovative services to federal, regional, and local government agencies, as well as to private industrial customers worldwide.\n\nParsons is an equal opportunity, drug-free employer committed to diversity in the workplace. Minority/Female/Disabled/Protected Veteran/LGBTQ+.\n\nFor more about Parsons, visit parsons.com and follow us on Facebook, Twitter, LinkedIn, and YouTube.",
    "applyUrl": "https://parsons.jobs/centreville-va/react-ui-developer/53F2549092AB43419569259775DC3CAC/job/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "postedDate": "2025-08-01",
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTWoeHM7rt-U37K1_ab3N5lIK6QuMuDbepnStZr&s=0"
  },
  {
    "id": "api-1754050921524-8",
    "title": "React Developer (Always Recruiting)",
    "company": "Dev Talent Network",
    "location": "Washington",
    "type": "Full-time",
    "description": "Dev's Talent Network is designed to create a network of talented applicants who are interested in working for Dev Technology and are waiting for a job opening that matches their skills and experience. Here you will find positions we are \"always recruiting\" as well as an opportunity to share your resume with Dev, even if the job position you seek is not listed here today.\n\nThe Dev Talent Network is a community of highly qualified technical and management professionals recognized by Dev to demonstrate strong alignment with our company culture. The Dev Talent Network is comprised of candidates, referrals, Dev alumni, and fellow colleagues with whom we have worked in the past.\n\nWe're excited to evolve the Dev Talent Network so our members stay connected with Dev and discover new career opportunities with us.\n\nDev Technology Group is looking for a React Developer. As a React.js Developer, you will be involved from conception to completion with projects that are technologically sound and aesthetically impressive.\n\nWhat You'll Be Doing:\n• Develop the latest user-facing features using React.js\n• Use markup languages like HTML to create user-friendly web pages\n• Design a modern highly responsive web-based user interface\n• Build reusable components and front-end libraries for future use\n• Translate designs and wireframes into high-quality code\n• Optimize components for maximum performance across a vast array of web-capable devices and browsers\n• Coordinate with various teams working on distinct layers\n• Maintain and improve website\n• Optimize applications for maximum speed\n• Collaborate with back-end developers and web designers to improve usability\n• Get feedback from, and build solutions for, users and customers\n• Write functional requirement documents and guides\n• Create quality mockups and prototypes\n• Help back-end developers with coding and troubleshooting\n• Ensure high-quality graphic standards and brand consistency\n• Stay up-to-date on emerging technologies\n\nRequired Skills and Experience:\n• Bachelor's degree in Computer Science or related field\n• 5+ years Java/J2EE development\n• 5+ years experience with React, Node, Angular\n• Strong proficiency in JavaScript\n• Thorough understanding of React.js and its core principles\n• Proven work experience as a developer\n• Hands-on experience with markup languages\n• Experience with RESTful APIs\n• Experience with HTML/CSS\n• Experience with code versioning tools such as Git\n• Experience with modern front-end build pipelines and tools\n• Knowledge of Spring, Spring Boot, JPA, Hibernate frameworks\n• Knowledge of modern authorization mechanisms\n• An ability to perform well in a fast-paced environment\n• Excellent analytical skills\n\nPreferred Skills and Experience:\n• SQL preferred\n• PostgreSQL preferred\n• Angular UI or related UI frameworks preferred\n• Experience with Chef, Maven, Ansible preferred\n• Experience with AWS Lambda, AWS Dynamo DB, Other AWS tools (Elastic Search, Cloud Watch, Kinesis, etc) preferred\n• Typescript preferred\n• **By submitting your information you agree our talent recruitment team may use your contact information to reach out to you regarding new opportunities that may be applicable to your experience.",
    "applyUrl": "https://www.ziprecruiter.com/c/Dev-Talent-Network/Job/React-Developer-(Always-Recruiting)/-in-Washington,DC?jid=8df3738081ef006f&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "postedDate": "2025-08-01"
  },
  {
    "id": "api-1754050921524-9",
    "title": "Sr. React Developer Jobs",
    "company": "Arena Technical Resources",
    "location": "Washington",
    "type": "Full-time",
    "description": "Job Title: Sr React Developer\n\nJob Location: Washington, D.C. – Remote\n\nEligibility/Clearance: Secret Clearance preferred, the candidate will be\n\nrequired to obtain and maintain a Secret security clearance, depending\n\non the project requirements.\n\nJob Description:\n\nThe Senior React Developer will be responsible for creating robust and\n\nscalable web applications using React. This position will play a crucial\n\nrole in developing and optimizing the company's B2B applications and\n\nexperiences. As a Senior React Developer, you will have the opportunity\n\nto contribute to the development of cutting-edge AI platforms and shape\n\nthe user experience. Deep experience with Generative AI is strongly\n\npreferred.\n\nResponsibilities (include but are not limited to):\n\n• Collaborate with end users and stakeholders to understand requirements\n\nand translate them into high-quality, scalable web applications\n\n• Design and develop user interfaces using React, ensuring a seamless\n\nand engaging user experience\n\n• Optimize applications for maximum speed and scalability, with a focus\n\non simplicity and optimization to meet project requirements without\n\noverengineering solutions\n\n• Conduct code reviews and provide mentorship to junior developers\n\n• Work closely with UX designers to ensure the successful implementation\n\nof designs, providing guidance and support throughout the development\n\nprocess\n\n• Stay up-to-date with industry trends and best practices in React\n\ndevelopment, incorporating them into the full-scope development process\n\nwith other team members\n\n• Collaborate with backend developers to integrate user-facing elements\n\nwith serverside logic\n\n• Use modern development tools and frameworks to create high-quality\n\ncode and interactive prototypes\n\n• Ensure the technical feasibility of UI/UX designs\n\nRequirements:\n\n• 5+ years of experience as a React Developer, with the ability to\n\nprovide examples showcasing expertise in building complex web\n\napplications\n\n• Proficiency in JavaScript and React.js\n\n• Experience in optimizing applications for complex B2B environments,\n\nensuring streamlined solutions that avoid unnecessary complexity or\n\nredundant features\n\n• Strong understanding of responsive design principles and the ability\n\nto create interfaces that work seamlessly across different devices and\n\nscreen sizes\n\n• Familiarity with HTML5 and CSS3\n\n• Strong problem-solving skills and the ability to think critically\n\nabout user needs and technical challenges\n\n• Excellent communication and collaboration skills, with the ability to\n\nwork effectively in cross-functional teams\n\n• A passion for clean code, user-centered design, and a strong attention\n\nto detail\n\n• Relevant certifications in Python development or related fields are a\n\nplus.\n\nEducation:\n\n• Must have Bachelor’s Degree in a technology related discipline\n\nArena Technical Resources, LLC, (ATR) is an Equal Opportunity Employer\n\n(EOE) who will provide equal employment opportunity to employees and\n\napplicants for employment without regard to race, ethnicity, religion,\n\ncolor, sex, pregnancy, national origin, age, veteran status, ancestry,\n\nsexual orientation, gender identity or expression, marital status,\n\nfamily structure, genetic information, or mental or physical disability",
    "applyUrl": "https://www.clearancejobs.com/jobs/8454745/sr-react-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "postedDate": "2025-07-29"
  }
]