[
  {
    "id": "rBxzodLHonshvmOgAAAAAA==",
    "title": "React Developer",
    "company": "Go Intellects Inc",
    "location": "Washington",
    "type": "Full-time",
    "description": "Benefits:\n• Competitive salary\n\nJob Description:\n\n6-10 years of experience as a SME/Developer in complex enterprise level developer projects. Provides assessments of technical and operational practices based on leading industry standards specific to the requested technology.\n\nThe ideal candidate will be able to work both independently and as part of a team of consultants to provide these services and will have the following skills/capabilities:\n• Interact with clients to understand complex business requirements\n• Create functional requirement and design for customizations\n• Accurately estimate level of effort for implementation tasks\n• Review developer proposed implementation and identify efficient designs\n• Work with Delivery architects, Technical Leads and developers to ensure access and security profiles meet the needs of the Agency, including verifying that the policies/restrictions in place.\n• Collaborate with Delivery architects, Technical Leads and developers to perform code reviews\n• Excellent written and oral English communication and presentation skills.\n\nEducation And Professional Qualifications\n• 4+ years’ experience implementing, developing, supporting and maintaining React applications\n• Strong teamwork and interpersonal skills\n• At least 2 years experience in Next.js (Required)\n• Ability to develop effective working relationships with all levels of personnel\n• Strong client-service orientation and focus\n• Thorough attention to detail and a strong desire to deliver the highest quality solutions to CFSAs\n• Experience across a variety of industries\n\nMinimum Education/Certification Requirements:\n• Bachelor’s degree in Information Technology or related field or equivalent experience ,the candidate may occasionally be asked to attend in-person meetings.\n\nFlexible work from home options available.",
    "applyUrl": "https://www.linkedin.com/jobs/view/react-developer-at-go-intellects-inc-4274223275?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "postedDate": "2025-07-31T00:00:00.000Z",
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQNVQCcHNvOWnHJfC0B7yenAHhbBeiszDqAV-6w&s=0",
    "tags": [
      "React",
      "JavaScript",
      "Frontend"
    ],
    "experience": "2+ years",
    "skills": [
      "React",
      "JavaScript",
      "TypeScript",
      "CSS",
      "HTML"
    ]
  },
  {
    "id": "GaUhAGGDoFRDLcFWAAAAAA==",
    "title": "React Developer",
    "company": "LIGHTFEATHER IO LLC",
    "location": "Ashburn",
    "type": "Full-time",
    "description": "LightFeather is seeking a Frontend Engineer with strong experience in React, Node.js, and TypeScript to help us build secure, performant applications used in federal environments. This role is ideal for someone who is comfortable across the stack, focused on clean, maintainable code, and excited to contribute to real-world federal solutions using modern tooling.\n\nLocation: Hybrid (2–3 days/week) in Ashburn, VA 20147\nJob Type: Full Time\nCitizenship: U.S. Citizenship Required\n\nClearance Requirement: Active Public Trust clearance required\n\nResponsibilities\n• Build and maintain cross-platform application features (web, Windows, and Android) using React and TypeScript\n• Ensure performance, responsiveness, and accessibility across all supported platforms\n• Collaborate with UI/UX designers to implement clean, user-friendly, and accessible experiences\n• Participate in Agile sprints, code reviews, and architecture discussions\n• Support cross-platform deployment workflows and testing processes\n\nMust-Have Qualifications\n• 2–5 years of professional software development experience\n• Strong hands-on experience with React\n• Strong hands-on experience with Node.js\n• Strong hands-on experience with TypeScript\n• Proven experience delivering cross-platform applications using React or related stacks\n• Active Public Trust clearance\n• U.S. Citizenship\n\nNice to Have\n• Experience with CapacitorJS\n• Experience with ElectronJS\n• Experience with TailwindCSS\n• Experience with TRPC\n• Experience with Figma\n• Experience with Storybook\n• Experience with Jest or Playwright\n• Experience with Java or Kotlin for native Android development\n• Familiarity with testing and deployment workflows for multi-platform applications\n• Experience working on government applications\n\nWhy Join LightFeather?\n\nYou'll be part of a team dedicated to meaningful impact, working on solutions that address mission-critical needs. Experience variety, fulfillment, and the opportunity to work with some of the best in the industry.",
    "applyUrl": "https://www.indeed.com/viewjob?jk=2ba34616f73ff3ac&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "postedDate": "2025-08-01T22:00:00.000Z",
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTcI_U3Cmu8eoxuZ5XvcqFhhyF9dpzjsAVmxCkq&s=0",
    "tags": [
      "React",
      "JavaScript",
      "Frontend"
    ],
    "experience": "2+ years",
    "skills": [
      "React",
      "JavaScript",
      "TypeScript",
      "CSS",
      "HTML"
    ]
  },
  {
    "id": "Kl16H-Wnhqwuy9X8AAAAAA==",
    "title": "Junior Software Developer (Full Stack - Python, React)",
    "company": "Jobright.ai",
    "location": "Washington",
    "type": "Full-time",
    "description": "Verified Job On Employer Career Site\n\nJob Summary:\n\nU.S. News & World Report is a multifaceted digital media company dedicated to helping citizens make important decisions. They are seeking an enthusiastic full stack Software Developer to build dynamic, data-driven products and create web applications that reach millions of visitors monthly.\n\nResponsibilities:\n\n• Create, implement, upgrade, optimize, and test features and projects.\n\n• Work directly with project owners.\n\n• Collaborate with designers, analysts, stakeholders, and testers.\n\n• Drive a major transformation within U.S. News.\n\nQualifications:\n\nRequired:\n\n• Minimum two years of related or similar full stack experience\n\n• A Bachelor’s degree in computer science or related field\n\n• Modern JavaScript frameworks, such as React\n\n• Web styling with CSS preprocessors or CSS-in-JS\n\n• Modern JavaScript patterns and ES6\n\n• Server-side technologies, such as Python, Java, or NodeJS\n\n• Databases, such as PostgreSQL\n\n• Unix-based operating systems, such as Linux or Mac OS X, along with the shells and command-line tools available in those environments\n\n• Version control, such as Git\n\nPreferred:\n\n• CICD pipelines such as Jenkins\n\n• Cloud environments such as AWS\n\n• Data ingestion/transformation\n\nCompany:\n\nU.S. News & World Report is an American media company that publishes consumer advice, rankings, and analysis. Founded in 1933, the company is headquartered in Washington, District of Columbia, USA, with a team of 501-1000 employees. The company is currently Late Stage. U.S. News & World Report has a track record of offering H1B sponsorships.",
    "applyUrl": "https://www.linkedin.com/jobs/view/junior-software-developer-full-stack-python-react-at-jobright-ai-4276891130?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "postedDate": "2025-07-31T00:00:00.000Z",
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRc11c46XEF7nUag98qauGWM3tBuQH8ELcz8Cbg&s=0",
    "tags": [
      "React",
      "JavaScript",
      "Frontend"
    ],
    "experience": "2+ years",
    "skills": [
      "React",
      "JavaScript",
      "TypeScript",
      "CSS",
      "HTML"
    ]
  },
  {
    "id": "-kxZwqa8O5UXUjJGAAAAAA==",
    "title": "React Developer",
    "company": "Go intellects Inc",
    "location": "Hillcrest Heights",
    "type": "Full-time",
    "description": "Benefits:\n• Competitive salary\n\nJob Description:\n6-10 years of experience as a SME/Developer in complex enterprise level developer projects. Provides assessments of technical and operational practices based on leading industry standards specific to the requested technology.\n\nThe ideal candidate will be able to work both independently and as part of a team of consultants to provide these services and will have the following skills/capabilities:\n• Interact with clients to understand complex business requirements\n• Create functional requirement and design for customizations\n• Accurately estimate level of effort for implementation tasks\n• Review developer proposed implementation and identify efficient designs\n• Work with Delivery architects, Technical Leads and developers to ensure access and security profiles meet the needs of the Agency, including verifying that the policies/restrictions in place.\n• Collaborate with Delivery architects, Technical Leads and developers to perform code reviews\n• Excellent written and oral English communication and presentation skills.\n\nEducation and Professional Qualifications\n• 4+ years’ experience implementing, developing, supporting and maintaining React applications\n• Strong teamwork and interpersonal skills\n• At least 2 years experience in Next.js (Required)\n• Ability to develop effective working relationships with all levels of personnel\n• Strong client-service orientation and focus\n• Thorough attention to detail and a strong desire to deliver the highest quality solutions to CFSAs\n• Experience across a variety of industries\n\nMinimum Education/Certification Requirements:\n• Bachelor’s degree in Information Technology or related field or equivalent experience ,the candidate may occasionally be asked to attend in-person meetings.\n\nFlexible work from home options available.",
    "applyUrl": "https://www.adzuna.com/details/5329993818?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "postedDate": "2025-07-31T00:00:00.000Z",
    "tags": [
      "React",
      "JavaScript",
      "Frontend"
    ],
    "experience": "2+ years",
    "skills": [
      "React",
      "JavaScript",
      "TypeScript",
      "CSS",
      "HTML"
    ]
  },
  {
    "id": "XwYPHWrgvu0UkdblAAAAAA==",
    "title": "AEM UI developer- React JS",
    "company": "Capgemini",
    "location": "Washington",
    "type": "Full-time",
    "description": "About the job you’re considering\n\nThe role requires React JS development experience with AEM UI exp.\n\nYour role\n• Develop and maintain responsive, high-performance web applications using ReactJS, adhering to the client React/JSX Style Guide.\n• integrating with AEM Content Fragments via GraphQL and REST APIs.\n• Instrument React applications with the Adobe Universal Editor for headless/headful content editing, ensuring seamless integration with AEM.\n• Build custom applications and extensions using Adobe AEM App Builder to manage content fragments and enhance user experiences.\n• Collaborate with backend teams to integrate with Node.js/Express servers and Apigee APIs\n• Optimize frontend performance and ensure cross-browser compatibility\n• Participate in code reviews, testing, and deployment within an Agile environment, utilizing monitoring tools like Application Insights and Splunk.\n\nYour skills and experience\n• Proficient in JavaScript (ES6+) and ReactJS.\n• Knowledge of Node.js and Express for backend integration.\n• Experience with Next.js (SSR/SSG) is a strong plus.\n• Hands-on experience with AEM Content Fragments, GraphQL, and REST APIs.\n• Proficiency with Adobe Universal Editor for content editing in React apps.\n• Familiarity with Adobe AEM App Builder for custom app development.\n• Experience with Azure cloud services (App Services) and Akamai CDN.\n• Understanding of API consumption (GraphQL, RESTful, OAuth).\n• Strong CSS/HTML skills for responsive and accessible design.\n• Ability to debug, optimize, and test frontend performance.\n• Experience with version control (e.g., Git) and CI/CD pipelines.\n• Preferable skills in server-side rendering (SSR) and static site generation (SSG) using frameworks like Next.js,\n• Excellent problem-solving, communication, and collaboration skills.\n• Ability to work effectively in a team and adapt to new tools.\n\n#LI-MS4 #LI-ONSITE\n\nLife at Capgemini\n\nCapgemini supports all aspects of your well-being throughout the changing stages of your life and career. For eligible employees, we offer:\n• Flexible work\n• Healthcare including dental, vision, mental health, and well-being programs\n• Financial well-being programs such as 401(k) and Employee Share Ownership Plan\n• Paid time off and paid holidays\n• Paid parental leave\n• Family building benefits like adoption assistance, surrogacy, and cryopreservation\n• Social well-being benefits like subsidized back-up child/elder care and tutoring\n• Mentoring, coaching and learning programs\n• Employee Resource Groups\n• Disaster Relief\n\nAbout Capgemini\n\nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to\nengineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion.\n\nGet the future you want | www.capgemini.com\n\nDisclaimer\n\nCapgemini is an Equal Opportunity Employer encouraging diversity in the workplace. All qualified applicants will receive consideration for employment without regard to race, national origin, gender identity/expression, age, religion, disability, sexual orientation, genetics, veteran status, marital status or any other characteristic protected by law.\n\nThis is a general description of the Duties, Responsibilities and Qualifications required for this position. Physical, mental, sensory or environmental demands may be referenced in an attempt to communicate the manner in which this position traditionally is performed. Whenever necessary to provide individuals with disabilities an equal employment opportunity, Capgemini will consider reasonable accommodations that might involve varying job requirements and/or changing the way this job is performed, provided that such accommodations do not pose an undue hardship.\n\nCapgemini is committed to providing reasonable accommodations during our recruitment process. If you need assistance or accommodation, please reach out to your recruiting contact.\n\nPlease be aware that Capgemini may capture your image (video or screenshot) during the interview process and that image may be used for verification, including during the hiring and onboarding process.\n\nClick the following link for more information on your rights as an Applicant http://www.capgemini.com/resources/equal-employment-opportunity-is-the-law\n\nApplicants for employment in the US must have valid work authorization that does not now and/or will not in the future require sponsorship of a visa for employment authorization in the US by Capgemini.\n\nCapgemini discloses salary range information in compliance with state and local pay transparency obligations. The disclosed range represents the lowest to highest salary we, in good faith, believe we would pay for this role at the time of this posting, although we may ultimately pay more or less than the disclosed range, and the range may be modified in the future. The disclosed range takes into account the wide range of factors that are considered in making compensation decisions including, but not limited to, geographic location, relevant education, qualifications, certifications, experience, skills, seniority, performance, sales or revenue-based metrics, and business or organizational needs. At Capgemini, it is not typical for an individual to be hired at or near the top of the range for their role. The base salary range for the tagged location is $76,200 - $178,290. This role may be eligible for other compensation including variable compensation, bonus, or commission. Full time regular employees are eligible for paid time off, medical/dental/vision insurance, 401(k), and any other benefits to eligible employees. Note: No amount of pay is considered to be wages or compensation until such amount is earned, vested, and determinable. The amount and availability of any bonus, commission, or any other form of compensation that are allocable to a particular employee remains in the Company's sole discretion unless and until paid and may be modified at the Company’s sole discretion, consistent with the law.",
    "applyUrl": "https://www.indeed.com/viewjob?jk=5e3751446bd43f43&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "postedDate": "2025-07-10T00:00:00.000Z",
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT5sgZoGfYI1XsIKjrk-ZrHWEbst6ThTBSeIZcL&s=0",
    "tags": [
      "React",
      "JavaScript",
      "Frontend"
    ],
    "experience": "2+ years",
    "skills": [
      "React",
      "JavaScript",
      "TypeScript",
      "CSS",
      "HTML"
    ]
  },
  {
    "id": "oiCcmzs1Sksj_ZFSAAAAAA==",
    "title": "React Software Developer - PostgreSQL AWS",
    "company": "Peraton",
    "location": "Washington",
    "type": "Full-time",
    "description": "About Peraton\nPeraton is a next-generation national security company that drives missions of consequence spanning the globe and extending to the farthest reaches of the galaxy. As the world's leading mission capability integrator and transformative enterprise IT provider, we deliver trusted, highly differentiated solutions and technologies to protect our nation and allies. Peraton operates at the critical nexus between traditional and nontraditional threats across all domains: land, sea, space, air, and cyberspace. The company serves as a valued partner to essential government agencies and supports every branch of the U.S. armed forces. Each day, our employees do the can't be done by solving the most daunting challenges facing our customers. Visit peraton.com to learn how we're keeping people around the world safe and secure.\n\nProgram Overview\n\nAbout The Role\n\nTechnology is constantly changing, and our adversaries are digitally exceeding law enforcement's ability to keep pace. Those charged with protecting the United States are not always able to access the evidence needed to prosecute crime and prevent terrorism. The Government has trusted in Peraton to provide the technical ability, tools, and resources to bring criminals to justice. In response to this challenge, Peraton is seeking skilled Full Stack Software Developers to develop a dynamic forms, web-based, application in a React, Node.JS and AWS environment.\n\nResponsibilities:\n• Design, test, and develop well designed web based software coding that is testable and efficient by using best software development practices to meet user's needs using tools like React, AWS, Postgres, and others\n• Translate the UI/UX design wireframes, ensuring software continues to function normally through software maintenance and testing; and documenting every aspects of the application, service or environment as a reference for future maintenance and upgrades.\n• Collaborate with customers and technical resources to translate requirements into Epics, Features, and User Stories for functional and non-functional requirements.\n• Support Agile teams in Backlog planning, work item refinement, and story point analysis.\n• Ensure User Stories have well-defined acceptance criteria.\n• Demonstrate work completed in a sprint to the customer.\n• Design software and solutions using industry standard design patterns and best practices.\n• Apply coding standards that support secure coding practices.\n• Develop automated unit and integration tests for continuous integration and delivery (CI/CD) pipelines.\n\nQualifications\n\nQualifications:\n• A current Top Secret security clearance with SCI eligibility and the ability to obtain a polygraph.\n• 4 years with AS/AA; 2 years with BS/BA; 0 years with MS/MA; 6 years with no degree.\n• Experience with implementing and using GitHub for CI/CD pipelines and DevSecOps deployments.\n• Experience with microservices, virtualization, and containerized deployments.\n• Experience with in React, Java, Javascript, Spring Boot in Visual Studio IDE.\n• Experience with SQL Server and PostgreSQL database technologies.\n\nPeraton offers enhanced benefits to employees working on this critical National Security program, which include heavily subsidized employee benefits coverage for you and your dependents, 25 days of PTO accrued annually up to a generous PTO cap and eligibility to participate in an attractive bonus plan.\n\nSCA / Union / Intern Rate or Range\n\nDetails\n\nTarget Salary Range: $80,000 - $128,000. This represents the typical salary range for this position based on experience and other factors.\n\nEEO: Equal opportunity employer, including disability and protected veterans, or other characteristics protected by law.",
    "applyUrl": "https://www.indeed.com/viewjob?jk=f8f04c112f228369&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "postedDate": "2025-07-25T00:00:00.000Z",
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTudV1E60jhv10w000N-X5BStl0ZLgkYpn3E2D4&s=0",
    "tags": [
      "React",
      "JavaScript",
      "Frontend"
    ],
    "experience": "2+ years",
    "skills": [
      "React",
      "JavaScript",
      "TypeScript",
      "CSS",
      "HTML"
    ]
  },
  {
    "id": "N95M2zMGpts1UP66AAAAAA==",
    "title": "React Developer (Always Recruiting)",
    "company": "Dev Talent Network",
    "location": "Washington",
    "type": "Full-time",
    "description": "Dev's Talent Network is designed to create a network of talented applicants who are interested in working for Dev Technology and are waiting for a job opening that matches their skills and experience. Here you will find positions we are \"always recruiting\" as well as an opportunity to share your resume with Dev, even if the job position you seek is not listed here today.\n\nThe Dev Talent Network is a community of highly qualified technical and management professionals recognized by Dev to demonstrate strong alignment with our company culture. The Dev Talent Network is comprised of candidates, referrals, Dev alumni, and fellow colleagues with whom we have worked in the past.\n\nWe're excited to evolve the Dev Talent Network so our members stay connected with Dev and discover new career opportunities with us.\n\nDev Technology Group is looking for a React Developer. As a React.js Developer, you will be involved from conception to completion with projects that are technologically sound and aesthetically impressive.\n\nWhat You'll Be Doing:\n• Develop the latest user-facing features using React.js\n• Use markup languages like HTML to create user-friendly web pages\n• Design a modern highly responsive web-based user interface\n• Build reusable components and front-end libraries for future use\n• Translate designs and wireframes into high-quality code\n• Optimize components for maximum performance across a vast array of web-capable devices and browsers\n• Coordinate with various teams working on distinct layers\n• Maintain and improve website\n• Optimize applications for maximum speed\n• Collaborate with back-end developers and web designers to improve usability\n• Get feedback from, and build solutions for, users and customers\n• Write functional requirement documents and guides\n• Create quality mockups and prototypes\n• Help back-end developers with coding and troubleshooting\n• Ensure high-quality graphic standards and brand consistency\n• Stay up-to-date on emerging technologies\n\nRequired Skills and Experience:\n• Bachelor's degree in Computer Science or related field\n• 5+ years Java/J2EE development\n• 5+ years experience with React, Node, Angular\n• Strong proficiency in JavaScript\n• Thorough understanding of React.js and its core principles\n• Proven work experience as a developer\n• Hands-on experience with markup languages\n• Experience with RESTful APIs\n• Experience with HTML/CSS\n• Experience with code versioning tools such as Git\n• Experience with modern front-end build pipelines and tools\n• Knowledge of Spring, Spring Boot, JPA, Hibernate frameworks\n• Knowledge of modern authorization mechanisms\n• An ability to perform well in a fast-paced environment\n• Excellent analytical skills\n\nPreferred Skills and Experience:\n• SQL preferred\n• PostgreSQL preferred\n• Angular UI or related UI frameworks preferred\n• Experience with Chef, Maven, Ansible preferred\n• Experience with AWS Lambda, AWS Dynamo DB, Other AWS tools (Elastic Search, Cloud Watch, Kinesis, etc) preferred\n• Typescript preferred\n• **By submitting your information you agree our talent recruitment team may use your contact information to reach out to you regarding new opportunities that may be applicable to your experience.",
    "applyUrl": "https://www.ziprecruiter.com/c/Dev-Talent-Network/Job/React-Developer-(Always-Recruiting)/-in-Washington,DC?jid=8df3738081ef006f&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "postedDate": "2025-08-02",
    "tags": [
      "React",
      "JavaScript",
      "Frontend"
    ],
    "experience": "2+ years",
    "skills": [
      "React",
      "JavaScript",
      "TypeScript",
      "CSS",
      "HTML"
    ]
  },
  {
    "id": "5oQlZkOvwnUAggHEAAAAAA==",
    "title": "Senior Full Stack React Developer (On-Site)",
    "company": "Lion Federal",
    "location": "Falls Church",
    "type": "Full-time",
    "description": "Senior Full Stack React Developer\n\nJob Type: On-site, full-time\n\nCity: Falls Church\n\nState/Province: Virginia\n\nLion Federal is a dynamic and rapidly expanding tech company dedicated to delivering cutting-edge AI-powered solutions tailored for enterprise-level clients, including the U.S. Federal government.\n\nAt Lion Federal, we believe our team is the heartbeat of our success. We’ve built an environment where your growth is nurtured, and your voice truly matters. Here, you’ll enjoy all the benefits of a large company, along with some rare perks that set us apart:\n• Build genuine connections with team members at all levels\n• Get quick, meaningful responses from leadership who genuinely care\n• Feel a true sense of ownership, because your insights and feedback shape the future of our company\n\nWe are seeking a highly motivated and experienced Senior Full Stack React Developer to join our dynamic team in Falls Church, VA.\n\nPosition Summary:\n\nIn this role, you will be responsible for both front-end and back-end development, working on building a scalable and efficient platform for enterprise clients. You will collaborate closely with our API and AI development teams to ensure seamless integration and optimal performance. The ideal candidate should be self-driven and capable of delivering robust, high-quality code in a fast-paced environment.\n\nKey Responsibilities:\n• Lead the design, development, and deployment of full-stack web applications using React (front-end) and Node.js, Python, or other relevant back-end technologies.\n• Build and optimize APIs and services for performance, scalability, and security.\n• Collaborate with back-end and AI/ML teams to integrate APIs, databases, and AI-driven services.\n• Ensure the platform is scalable, secure, and optimized for performance, both on the front end and back end.\n• Write clean, maintainable, and well-documented code.\n• Participate in the full software development lifecycle, including code reviews, testing, and continuous deployment.\n• Take ownership of the product lifecycle, ensuring MVPs are delivered quickly to meet business deadlines.\n• Stay up-to-date with industry trends and emerging technologies to ensure our platform stays at the forefront of innovation.\n\nRequirements\n\nRequirements:\n• 5+ years of professional experience in full-stack development with a strong focus on React for front-end development.\n• Proficiency in front-end technologies like JavaScript/TypeScript, HTML5, CSS3, and state management libraries (Redux, Context API).\n• Expertise in back-end technologies like Node.js, Python, or similar, along with experience in building RESTful APIs.\n• Strong understanding of database systems (SQL, NoSQL) and cloud infrastructure (AWS, Azure, Google Cloud).\n• Familiarity with version control tools like Git and CI/CD pipelines.\n• Experience with containerization tools (Docker) and cloud deployment (Kubernetes) is a plus.\n• Excellent communication and problem-solving skills.\n• Self-starter with a passion for innovation and delivering high-quality products.\n\nNice-to-Haves:\n• Experience with AI/ML technologies, particularly Generative AI or LLMs.\n• Exposure to cloud platforms such as AWS, Azure, or Google Cloud.\n• Knowledge of DevOps practices and cloud infrastructure management.\n\nBenefits\n\nWhy Join Us?\n• Be a key player in building innovative AI-driven solutions for enterprise clients.\n• Collaborate with a team of experienced developers and AI experts.\n• Competitive salary and benefits package.\n• Opportunity to make a significant impact and shape the future of our product.\n\nBenefits:\n• Comprehensive CareFirst BCBS Medical, Dental, and Vision insurance fully covered for you and your family\n• Supportive team environment with outstanding leadership that values employee well-being\n• Generous paid time off, plus 11 paid holidays\n• 401(k) retirement plan with employer match\n• Performance-driven bonus program\n• Budget allocated for professional development and growth",
    "applyUrl": "https://www.indeed.com/viewjob?jk=5f515c2eee9e24eb&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "postedDate": "2025-08-02",
    "tags": [
      "React",
      "JavaScript",
      "Frontend"
    ],
    "experience": "2+ years",
    "skills": [
      "React",
      "JavaScript",
      "TypeScript",
      "CSS",
      "HTML"
    ]
  },
  {
    "id": "vpOqQXeAn7ROHOznAAAAAA==",
    "title": "Lead Frontend/Angular Developer :: McLean, VA",
    "company": "Jobs via Dice",
    "location": "McLean",
    "type": "Full-time",
    "description": "Dice is the leading career destination for tech experts at every stage of their careers. Our client, Bright Sol, is seeking the following. Apply via Dice today!\n\nRole: Lead Frontend/Angular Developer\n\nLocation: McLean, VA\n\nDuration: 12-14 months\n\nLooking for 10+years profiles\n\nLinkedIn Required\n\nJob Description:\n• Angular 14 or later, Ngrx, RxJS JavaScript, NodeJS, GitHub, understanding of end to end test and unit test\n• Role Info:\n• Hands on Sr. Frontend / Angular Developer role with strong Angular, Typescript, Ngrx, RxJS, Javascript, NodeJS, HTML, & CSS background\n• Front end development\n• Managing existing components and building new components using Angular 14\n• NodeJS\n• 2 Weeks sprint cycle\n• Unit testing using Cypress\n• A/B testing\n\nTop Skills:\n• Angular 14 / Higher exp is a must\n• Typescript exp is a must\n• NGRX, RXJS must have\n• HTML & CSS exp is a must\n• A/B Testing exp / knowledge is required\n\nNice to have:\n• Bloom reach / Gravity - CMS tool\n• Ex client is a plus\n• New Relic",
    "applyUrl": "https://www.linkedin.com/jobs/view/lead-frontend-angular-developer-mclean-va-at-jobs-via-dice-4277963479?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "postedDate": "2025-08-02T00:00:00.000Z",
    "logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR9CC1NlnLA7sshF1s1dqKvk8U495jsMwImnyPP&s=0",
    "tags": [
      "React",
      "JavaScript",
      "Frontend"
    ],
    "experience": "2+ years",
    "skills": [
      "React",
      "JavaScript",
      "TypeScript",
      "CSS",
      "HTML"
    ]
  },
  {
    "id": "tvJnzvGZsmHjcHrPAAAAAA==",
    "title": "React Developer",
    "company": "Insight Global",
    "location": "Arlington",
    "type": "Full-time and Contractor",
    "description": "This developer will participate in building and modernizing web-based applications to support our projects, work with technical leads to develop and enforce standards, collaborate with a development team, and follow solutions as they are developed through production deployment. The team performs custom software development to modernize siloed, legacy applications using modular design standards. The team works closely with clients and other contractors to ensure the performance and reliability of public-facing, mission-critical applications.\n\nWhat you'll be doing:\n• Identifies requirements by establishing personal rapport with potential and actual clients and with other persons in a position to understand service requirements\n• Develops and maintains applications and databases by evaluating client needs; analyzing requirements; developing software systems\n• Bug fixing, browser testing, accessibility testing\n• Documenting code and processes\n• Collaborate with designers, developers, and project managers on client work\n• Communicating with co-workers about your projects and tasks\n• Actively participate in project discussions and team meetings (e.g., daily standups, code reviews)",
    "applyUrl": "https://jobs.insightglobal.com/find_a_job/virginia/job-318103/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "postedDate": "2025-08-02",
    "tags": [
      "React",
      "JavaScript",
      "Frontend"
    ],
    "experience": "2+ years",
    "skills": [
      "React",
      "JavaScript",
      "TypeScript",
      "CSS",
      "HTML"
    ]
  }
]